tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "homebrew/bundle"
tap "mongodb/brew"
tap "nikitabobko/tap"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Speech synthesizer that supports more than hundred languages and accents
brew "espeak-ng"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# X.509 and CMS library
brew "libksba"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# YAML Parser
brew "libyaml"
# Open-source, cross-platform JavaScript runtime environment
brew "node@20"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# General-purpose speech recognition model
brew "openai-whisper"
# AI coding agent, built for the terminal
brew "opencode"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Safe, concurrent, practical language
brew "rust"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Graphical user interface for chess
brew "xboard"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# A window border system for macOS
brew "felixkratz/formulae/borders", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Clipboard manager for developers
cask "flycut"
# Control your tools with a few keystrokes
cask "raycast"
# System monitor for the menu bar
cask "stats"
# Open-source version of the X.Org X Window System
cask "xquartz"
vscode "anthropic.claude-code"
vscode "boundary.baml-extension"
vscode "castwide.ruby-debug"
vscode "marhaendev.word-count-selection"
vscode "mathematic.vscode-pdf"
vscode "ms-vscode.vscode-speech"
vscode "ngtystr.ppm-pgm-viewer-for-vscode"
vscode "ritwickdey.liveserver"
vscode "samplavigne.p5-vscode"
vscode "streetsidesoftware.code-spell-checker"
npm "corepack"
